app/Controllers/Admin.php

SELECT *
FROM `tbl_admin`
WHERE `email` = 'jane@me.com'
AND `password` = '9d4e1e23bd5b727046a9e3b4b7db57bd8d6ee684'
 LIMIT 1
---
    public function login(){
        if($this->request->getMethod()=='POST'){
            $post = $this->request->getPost(['email','password']);
            $admin_model = new \App\Models\AdminModel();
            $admin=$admin_model->where('email',$post['email'])
            ->where('password',sha1($post['password']))
            ->first();