app/Controllers/Item.php

SELECT *
FROM `tbl_item`
---
    public function index()
    {
        $item_model = new ItemModel();

        $query = $this->request->getGet('query');
        if ($query) {
            $data['items'] = $item_model->like('name', $query)->orLike('description', $query)->findAll();
            $data['query'] = $query;  // Pass the query back to the view
        } else {
            $data['items'] = $item_model->findAll();

INSERT INTO `tbl_item` (`name`, `description`, `price`) VALUES ('Apple Vinegar', 'Apple Vinegar', '123')
---
    public function add(){
        helper('text'); //to secure on sql injection
        $data=array();
        //helper('form');
        if($this->request->getMethod()=='POST'){

            $post['name'] = strip_quotes($_POST['name']);
            $post['description'] = strip_quotes($_POST['description']);
            $post['price'] = strip_quotes($_POST['price']);
            //$post = $this->request->getPost(['name','description','price']);

            $rules = [
                'name' =>['label' => 'item name', 'rules' => 'required'],
                'description' =>['label' => 'description', 'rules' => 'required'],
                'price' =>['label' => 'price', 'rules' => 'required|numeric']
            ];

            if(!$this->validate($rules)){
                $data['validation'] = $this->validator;
            }
            else {
                $item_model = new \App\Models\ItemModel();
                $item_model->save($post);

SELECT *
FROM `tbl_item`
WHERE `tbl_item`.`id` = '1'
---
    public function edit($id){
        helper('text'); //to secure on sql injection
        if($this->request->getMethod()=='POST'){

            $post['name'] = strip_quotes($_POST['name']);
            $post['description'] = strip_quotes($_POST['description']);
            $post['price'] = strip_quotes($_POST['price']);
            //$post = $this->request->getPost(['name','description','price']);

            $rules = [
                'name' =>['label' => 'item name', 'rules' => 'required'],
                'description' =>['label' => 'description', 'rules' => 'required'],
                'price' =>['label' => 'price', 'rules' => 'required|numeric']
            ];

            if(!$this->validate($rules)){
                $data['validation'] = $this->validator;
            }
            else {
                $item_model = new \App\Models\ItemModel();
                $item_model->update($id,$post);
                return redirect()->to('Item/index');
            }

        }

        $item_model = new \App\Models\ItemModel();
        $data['item']=$item_model->find($id);

SELECT *
FROM `tbl_item`
WHERE `tbl_item`.`id` = '1'
---
    public function delete($id){

        if($this->request->getMethod()=='POST'){
            $item_model = new \App\Models\ItemModel();
            $item_model->delete($id);
            return redirect()->to('item/index');
        }

        $item_model = new \App\Models\ItemModel();
        $data['item']=$item_model->find($id);